app/controllers/mail_contexts_controller.rb

  def index
    @mail_contexts = MailContext.all
---
SELECT `mail_contexts`.* FROM `mail_contexts`

  def create
    @mail_context = MailContext.new(mail_context_params)

    respond_to do |format|
      if @mail_context.save
---
INSERT INTO `mail_contexts` (`email`, `message_body`, `time_part`, `user_id`, `starts_at`, `ends_at`, `created_at`, `updated_at`) VALUES ('raghuraas@gmail.com', 'hi', '2', 's', '2015-08-10 10:42:00.000000', '2015-03-10 10:42:00.000000', '2015-08-10 10:42:58.506145', '2015-08-10 10:42:58.506145')

  def destroy
    @mail_context.destroy
---
DELETE FROM `mail_contexts` WHERE `mail_contexts`.`id` = 1

    def set_mail_context
      @mail_context = MailContext.find(params[:id])
---
SELECT  `mail_contexts`.* FROM `mail_contexts` WHERE `mail_contexts`.`id` = 1 LIMIT 1